# '龍龍','龍鸡','龍牛','龍蛇','蛇猴','龍虎','龍牛','龍猪','蛇猪','蛇羊','龍驴','蛇兔','蛇猪','蛇虎','蛇鼠','龍兔','龍牛','龍猴','蛇猪','龍虎','龍马','龍羊','蛇猪','龍猪','龍兔','蛇虎','蛇虎','蛇猪','蛇狗'

function 因戴克斯(爱特姆){
    var 忒博欧 = "鼠牛虎兔龍蛇马羊猴鸡狗猪";
    var 难博 = 忒博欧.length;
    for(var i = 0 ; i < 忒博欧.length ; i++){
        if (忒博欧[i] == 爱特姆) {
            return i;
        }
    }
    return 难博;
}
function 給屋冪呃查(难博){
    var 茶 = 因戴克斯(难博);
    if(茶<0){
        茶 = 12;
    }
	if(茶>=2){
		茶++;
		if(茶>=4){
			茶++;
			if(茶>=10){
				茶++;
			}
		}
	}
	return 茶.toString(頭 + 10);
}
var 頭 = "0x";
function 弗萊格(){
	var 貝斯拾贰 = ['蛇狗','蛇猪','蛇虎','蛇虎','龍兔','龍猪','蛇猪','龍羊','龍马','龍虎','蛇猪','龍猴','龍牛','龍兔','蛇鼠','蛇虎','蛇猪','蛇兔','龍驴','蛇羊','蛇猪','龍猪','龍牛','龍虎','蛇猴','龍蛇','龍牛','龍鸡','龍龍'];
    var ostr = '';
    for(i = 0,len=貝斯拾贰.length; i < len; i++) {
		ostr += String.fromCharCode(頭 + 給屋冪呃查(貝斯拾贰[len-i-1][0]) + 給屋冪呃查(貝斯拾贰[len-i-1][1]));
    }
    console.log(ostr);
}
弗萊格();
